app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first_name", "Test"], ["last_name", ""], ["email", ""], ["phone", ""], ["twitter", ""], ["created_at", "2022-06-23 22:18:27.388677"], ["updated_at", "2022-06-23 22:18:27.388677"], ["user_id", 9]]

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "last_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "trt"], ["updated_at", "2022-06-23 23:47:37.201275"], ["id", 25]]